architecture_diagrams/mongo-jdbc-driver-master_architecture.dot
digraph Architecture {
    rankdir=TB;
    node [shape=box, style=filled, fillcolor=lightblue];

    "TestUtils" [label="TestUtils\n(TestUtils.java)"];
    "MongoSQLTestUtils" [label="MongoSQLTestUtils\n(MongoSQLTestUtils.java)"];
    "PrintUtils" [label="PrintUtils\n(PrintUtils.java)"];
    "Main" [label="Main\n(Main.java)"];
    "SmokeTest" [label="SmokeTest\n(SmokeTest.java)"];
    "BsonTypeInfoTest" [label="BsonTypeInfoTest\n(BsonTypeInfoTest.java)"];
    "MongoMock" [label="MongoMock\n(MongoMock.java)"];
    "MongoDriverTest" [label="MongoDriverTest\n(MongoDriverTest.java)"];
    "MongoConnectionTest" [label="MongoConnectionTest\n(MongoConnectionTest.java)"];
    "TestConnectionString" [label="TestConnectionString\n(TestConnectionString.java)"];
    "MongoJsonSchemaTest" [label="MongoJsonSchemaTest\n(MongoJsonSchemaTest.java)"];
    "BsonUtilsTest" [label="BsonUtilsTest\n(BsonUtilsTest.java)"];
    "MongoDatabaseMetaDataTest" [label="MongoDatabaseMetaDataTest\n(MongoDatabaseMetaDataTest.java)"];
    "MongoSQLTranslateLibTest" [label="MongoSQLTranslateLibTest\n(MongoSQLTranslateLibTest.java)"];
    "MongoStatementTest" [label="MongoStatementTest\n(MongoStatementTest.java)"];
    "MongoResultSetTest" [label="MongoResultSetTest\n(MongoResultSetTest.java)"];
    "MongoResultSetMetaDataTest" [label="MongoResultSetMetaDataTest\n(MongoResultSetMetaDataTest.java)"];
    "RFC8252HttpServerTest" [label="RFC8252HttpServerTest\n(RFC8252HttpServerTest.java)"];
    "AuthX509IntegrationTest" [label="AuthX509IntegrationTest\n(AuthX509IntegrationTest.java)"];
    "DCIntegrationTest" [label="DCIntegrationTest\n(DCIntegrationTest.java)"];
    "ADFIntegrationTest" [label="ADFIntegrationTest\n(ADFIntegrationTest.java)"];
    "TestTypeInfo" [label="TestTypeInfo\n(TestTypeInfo.java)"];
    "TestGenerator" [label="TestGenerator\n(TestGenerator.java)"];
    "DataLoader" [label="DataLoader\n(DataLoader.java)"];
    "TestDataEntry" [label="TestDataEntry\n(TestDataEntry.java)"];
    "TestEntry" [label="TestEntry\n(TestEntry.java)"];
    "TestData" [label="TestData\n(TestData.java)"];
    "Tests" [label="Tests\n(Tests.java)"];
    "MongoListTablesResult" [label="MongoListTablesResult\n(MongoListTablesResult.java)"];
    "BuildInfo" [label="BuildInfo\n(BuildInfo.java)"];
    "MongoRunCmdListTablesResult" [label="MongoRunCmdListTablesResult\n(MongoRunCmdListTablesResult.java)"];
    "Pair" [label="Pair\n(Pair.java)"];
    "MongoConnectionProperties" [label="MongoConnectionProperties\n(MongoConnectionProperties.java)"];
    "MongoDatabaseMetaData" [label="MongoDatabaseMetaData\n(MongoDatabaseMetaData.java)"];
    "MongoResultSetMetaData" [label="MongoResultSetMetaData\n(MongoResultSetMetaData.java)"];
    "MongoBsonValue" [label="MongoBsonValue\n(MongoBsonValue.java)"];
    "MongoSerializationException" [label="MongoSerializationException\n(MongoSerializationException.java)"];
    "MongoResultSet" [label="MongoResultSet\n(MongoResultSet.java)"];
    "SortableBsonDocument" [label="SortableBsonDocument\n(SortableBsonDocument.java)"];
    "MongoDriver" [label="MongoDriver\n(MongoDriver.java)"];
    "BsonExplicitCursor" [label="BsonExplicitCursor\n(BsonExplicitCursor.java)"];
    "MongoPreparedStatement" [label="MongoPreparedStatement\n(MongoPreparedStatement.java)"];
    "MongoJsonSchemaResult" [label="MongoJsonSchemaResult\n(MongoJsonSchemaResult.java)"];
    "MongoVersionedJsonSchema" [label="MongoVersionedJsonSchema\n(MongoVersionedJsonSchema.java)"];
    "DataLake" [label="DataLake\n(DataLake.java)"];
    "MongoStatement" [label="MongoStatement\n(MongoStatement.java)"];
    "MongoFunctions" [label="MongoFunctions\n(MongoFunctions.java)"];
    "JsonSchema" [label="JsonSchema\n(JsonSchema.java)"];
    "NoCheckStateJsonWriter" [label="NoCheckStateJsonWriter\n(NoCheckStateJsonWriter.java)"];
    "MongoColumnInfo" [label="MongoColumnInfo\n(MongoColumnInfo.java)"];
    "MongoJsonSchema" [label="MongoJsonSchema\n(MongoJsonSchema.java)"];
    "MongoConnection" [label="MongoConnection\n(MongoConnection.java)"];
    "JdbcOidcCallbackContext" [label="JdbcOidcCallbackContext\n(JdbcOidcCallbackContext.java)"];
    "OidcTimeoutException" [label="OidcTimeoutException\n(OidcTimeoutException.java)"];
    "JdbcOidcCallback" [label="JdbcOidcCallback\n(JdbcOidcCallback.java)"];
    "RFC8252HttpServer" [label="RFC8252HttpServer\n(RFC8252HttpServer.java)"];
    "OidcAuthFlow" [label="OidcAuthFlow\n(OidcAuthFlow.java)"];
    "JdbcIdpInfo" [label="JdbcIdpInfo\n(JdbcIdpInfo.java)"];
    "OidcResponse" [label="OidcResponse\n(OidcResponse.java)"];
    "TestOidcUtils" [label="TestOidcUtils\n(TestOidcUtils.java)"];
    "TestOidcAuthFlowAndRefresh" [label="TestOidcAuthFlowAndRefresh\n(TestOidcAuthFlowAndRefresh.java)"];
    "TestRFC8252Server" [label="TestRFC8252Server\n(TestRFC8252Server.java)"];
    "TestOidcAuthFlow" [label="TestOidcAuthFlow\n(TestOidcAuthFlow.java)"];
    "TestOidcCallbackWithBadRefreshToken" [label="TestOidcCallbackWithBadRefreshToken\n(TestOidcCallbackWithBadRefreshToken.java)"];
    "TestOidcCallback" [label="TestOidcCallback\n(TestOidcCallback.java)"];
    "TestOidcCallbackWithShortTimeout" [label="TestOidcCallbackWithShortTimeout\n(TestOidcCallbackWithShortTimeout.java)"];
    "NativeLoader" [label="NativeLoader\n(NativeLoader.java)"];
    "BsonUtils" [label="BsonUtils\n(BsonUtils.java)"];
    "X509Authentication" [label="X509Authentication\n(X509Authentication.java)"];
    "MongoSQLException" [label="MongoSQLException\n(MongoSQLException.java)"];
    "GetNamespacesResult" [label="GetNamespacesResult\n(GetNamespacesResult.java)"];
    "TranslateResult" [label="TranslateResult\n(TranslateResult.java)"];
    "GetMongosqlTranslateVersionResult" [label="GetMongosqlTranslateVersionResult\n(GetMongosqlTranslateVersionResult.java)"];
    "MongoSQLTranslate" [label="MongoSQLTranslate\n(MongoSQLTranslate.java)"];
    "CheckDriverVersionResult" [label="CheckDriverVersionResult\n(CheckDriverVersionResult.java)"];
    "QueryDiagnostics" [label="QueryDiagnostics\n(QueryDiagnostics.java)"];
    "MongoLogger" [label="MongoLogger\n(MongoLogger.java)"];
    "MongoSimpleFormatter" [label="MongoSimpleFormatter\n(MongoSimpleFormatter.java)"];

    "TestUtils" -> "MongoSQLTestUtils" [arrowhead=empty, color=blue];
    "MongoMock" -> "MongoConnectionTest" [arrowhead=empty, color=blue];
    "TestConnectionString" -> "MongoDriver" [style=dotted, color=red];
    "BsonUtilsTest" -> "BsonUtils" [style=dotted, color=red];
    "MongoSQLTranslateLibTest" -> "MongoLogger" [style=dotted, color=red];
    "MongoSQLTranslateLibTest" -> "GetMongosqlTranslateVersionResult" [style=dotted, color=red];
    "MongoSQLTranslateLibTest" -> "MongoSQLException" [style=dotted, color=red];
    "MongoSQLTranslateLibTest" -> "MongoSQLTranslate" [style=dotted, color=red];
    "MongoMock" -> "MongoStatementTest" [arrowhead=empty, color=blue];
    "MongoMock" -> "MongoResultSetTest" [arrowhead=empty, color=blue];
    "MongoMock" -> "MongoResultSetMetaDataTest" [arrowhead=empty, color=blue];
    "DCIntegrationTest" -> "MongoConnection" [style=dotted, color=red];
    "DCIntegrationTest" -> "MongoDatabaseMetaData" [style=dotted, color=red];
    "DCIntegrationTest" -> "Pair" [style=dotted, color=red];
    "DCIntegrationTest" -> "MongoSQLException" [style=dotted, color=red];
    "ADFIntegrationTest" -> "MongoConnection" [style=dotted, color=red];
    "ADFIntegrationTest" -> "TestEntry" [style=dotted, color=red];
    "TestGenerator" -> "MongoResultSetMetaData" [style=dotted, color=red];
    "TestGenerator" -> "ADFIntegrationTest" [style=dotted, color=red];
    "TestGenerator" -> "TestEntry" [style=dotted, color=red];
    "DataLoader" -> "Pair" [style=dotted, color=red];
    "DataLoader" -> "TestData" [style=dotted, color=red];
    "DataLoader" -> "TestDataEntry" [style=dotted, color=red];
    "DatabaseMetaData" -> "MongoDatabaseMetaData" [arrowhead=empty, style=dashed, color=green];
    "MongoDatabaseMetaData" -> "MongoLogger" [style=dotted, color=red];
    "MongoDatabaseMetaData" -> "MongoSQLException" [style=dotted, color=red];
    "ResultSetMetaData" -> "MongoResultSetMetaData" [arrowhead=empty, style=dashed, color=green];
    "MongoResultSetMetaData" -> "MongoLogger" [style=dotted, color=red];
    "MongoResultSetMetaData" -> "QueryDiagnostics" [style=dotted, color=red];
    "Exception" -> "MongoSerializationException" [arrowhead=empty, color=blue];
    "ResultSet" -> "MongoResultSet" [arrowhead=empty, style=dashed, color=green];
    "MongoResultSet" -> "MongoLogger" [style=dotted, color=red];
    "BsonDocument" -> "SortableBsonDocument" [arrowhead=empty, color=blue];
    "Comparable" -> "SortableBsonDocument" [arrowhead=empty, style=dashed, color=green];
    "Driver" -> "MongoDriver" [arrowhead=empty, style=dashed, color=green];
    "MongoDriver" -> "NativeLoader" [style=dotted, color=red];
    "MongoCursor" -> "BsonExplicitCursor" [arrowhead=empty, style=dashed, color=green];
    "PreparedStatement" -> "MongoPreparedStatement" [arrowhead=empty, style=dashed, color=green];
    "MongoPreparedStatement" -> "MongoLogger" [style=dotted, color=red];
    "Statement" -> "MongoStatement" [arrowhead=empty, style=dashed, color=green];
    "MongoStatement" -> "MongoLogger" [style=dotted, color=red];
    "MongoStatement" -> "QueryDiagnostics" [style=dotted, color=red];
    "MongoStatement" -> "GetNamespacesResult" [style=dotted, color=red];
    "MongoStatement" -> "MongoSQLException" [style=dotted, color=red];
    "MongoStatement" -> "MongoSQLTranslate" [style=dotted, color=red];
    "MongoStatement" -> "TranslateResult" [style=dotted, color=red];
    "JsonWriter" -> "NoCheckStateJsonWriter" [arrowhead=empty, color=blue];
    "MongoJsonSchema" -> "BsonUtils" [style=dotted, color=red];
    "Connection" -> "MongoConnection" [arrowhead=empty, style=dashed, color=green];
    "MongoConnection" -> "MongoLogger" [style=dotted, color=red];
    "MongoConnection" -> "MongoSimpleFormatter" [style=dotted, color=red];
    "MongoConnection" -> "MongoSQLException" [style=dotted, color=red];
    "MongoConnection" -> "MongoSQLTranslate" [style=dotted, color=red];
    "MongoConnection" -> "JdbcOidcCallback" [style=dotted, color=red];
    "MongoConnection" -> "X509Authentication" [style=dotted, color=red];
    "OidcCallbackContext" -> "JdbcOidcCallbackContext" [arrowhead=empty, style=dashed, color=green];
    "Exception" -> "OidcTimeoutException" [arrowhead=empty, color=blue];
    "OidcCallback" -> "JdbcOidcCallback" [arrowhead=empty, style=dashed, color=green];
    "JdbcOidcCallback" -> "MongoLogger" [style=dotted, color=red];
    "OidcAuthFlow" -> "MongoLogger" [style=dotted, color=red];
    "MongoCredential" -> "JdbcIdpInfo" [arrowhead=empty, style=dashed, color=green];
    "TestOidcUtils" -> "JdbcIdpInfo" [style=dotted, color=red];
    "TestOidcUtils" -> "OidcAuthFlow" [style=dotted, color=red];
    "TestOidcAuthFlowAndRefresh" -> "JdbcOidcCallbackContext" [style=dotted, color=red];
    "TestOidcAuthFlowAndRefresh" -> "OidcAuthFlow" [style=dotted, color=red];
    "TestRFC8252Server" -> "OidcResponse" [style=dotted, color=red];
    "TestRFC8252Server" -> "OidcTimeoutException" [style=dotted, color=red];
    "TestRFC8252Server" -> "RFC8252HttpServer" [style=dotted, color=red];
    "TestOidcAuthFlow" -> "JdbcOidcCallbackContext" [style=dotted, color=red];
    "TestOidcAuthFlow" -> "OidcAuthFlow" [style=dotted, color=red];
    "TestOidcCallbackWithBadRefreshToken" -> "JdbcOidcCallback" [style=dotted, color=red];
    "TestOidcCallbackWithBadRefreshToken" -> "JdbcOidcCallbackContext" [style=dotted, color=red];
    "TestOidcCallback" -> "JdbcOidcCallback" [style=dotted, color=red];
    "TestOidcCallback" -> "JdbcOidcCallbackContext" [style=dotted, color=red];
    "TestOidcCallbackWithShortTimeout" -> "JdbcOidcCallback" [style=dotted, color=red];
    "TestOidcCallbackWithShortTimeout" -> "JdbcOidcCallbackContext" [style=dotted, color=red];
    "TestOidcCallbackWithShortTimeout" -> "OidcTimeoutException" [style=dotted, color=red];
    "NativeLoader" -> "MongoDriver" [style=dotted, color=red];
    "BsonUtils" -> "MongoSerializationException" [style=dotted, color=red];
    "BsonUtils" -> "NoCheckStateJsonWriter" [style=dotted, color=red];
    "X509Authentication" -> "MongoLogger" [style=dotted, color=red];
    "Exception" -> "MongoSQLException" [arrowhead=empty, color=blue];
    "GetNamespacesResult" -> "MongoDriver" [style=dotted, color=red];
    "GetNamespacesResult" -> "BsonUtils" [style=dotted, color=red];
    "TranslateResult" -> "JsonSchema" [style=dotted, color=red];
    "TranslateResult" -> "MongoDriver" [style=dotted, color=red];
    "TranslateResult" -> "MongoJsonSchema" [style=dotted, color=red];
    "TranslateResult" -> "BsonUtils" [style=dotted, color=red];
    "GetMongosqlTranslateVersionResult" -> "MongoDriver" [style=dotted, color=red];
    "GetMongosqlTranslateVersionResult" -> "BsonUtils" [style=dotted, color=red];
    "MongoSQLTranslate" -> "MongoDriver" [style=dotted, color=red];
    "MongoSQLTranslate" -> "MongoJsonSchema" [style=dotted, color=red];
    "MongoSQLTranslate" -> "MongoJsonSchemaResult" [style=dotted, color=red];
    "MongoSQLTranslate" -> "MongoSerializationException" [style=dotted, color=red];
    "MongoSQLTranslate" -> "MongoLogger" [style=dotted, color=red];
    "MongoSQLTranslate" -> "BsonUtils" [style=dotted, color=red];
    "CheckDriverVersionResult" -> "MongoDriver" [style=dotted, color=red];
    "CheckDriverVersionResult" -> "BsonUtils" [style=dotted, color=red];
    "QueryDiagnostics" -> "MongoDriver" [style=dotted, color=red];
    "QueryDiagnostics" -> "MongoJsonSchema" [style=dotted, color=red];
    "QueryDiagnostics" -> "BsonUtils" [style=dotted, color=red];
    "MongoLogger" -> "MongoJsonSchema" [style=dotted, color=red];
    "Formatter" -> "MongoSimpleFormatter" [arrowhead=empty, color=blue];
}
